trunk/app/controllers/challenges_controller.rb

  def show
    @challenge = Challenge.find(params[:id])
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @challenge = Challenge.find(params[:id])
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    # TODO !!!
    @object_name = params[:challenge][:type].to_s + ".new"
    logger.debug(@object_name)
    @challenge = eval(@object_name)
    @game = Game.find(params[:game_id])
    @challenge.game = @game

    respond_to do |format|
      if @challenge.update_attributes(params[:challenge]) and @challenge.save
---
INSERT INTO "challenges" ("created_at", "description", "game_id", "points", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 03 Dec 2011 15:46:58 UTC +00:00], ["description", "2231"], ["game_id", 2], ["points", 123], ["title", "3"], ["updated_at", Sat, 03 Dec 2011 15:46:58 UTC +00:00]]

  def update
    @challenge = Challenge.find(params[:id])
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @challenge = Challenge.find(params[:id])
    @challenge.destroy
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "challenges" WHERE "challenges"."id" = ?  [["id", 980190962]]