trunk/app/controllers/games_controller.rb

  def index
    @games = Game.paginate(:page => params[:page], :per_page => 1)
---
SELECT "games".* FROM "games"

  def create
    @game = Game.new(params[:game])
    @game.creator = current_user
    respond_to do |format|
      if @game.save
---
INSERT INTO "games" ("created_at", "creator_id", "description", "status", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 03 Dec 2011 14:47:20 UTC +00:00], ["creator_id", 1], ["description", ""], ["status", ""], ["title", ""], ["updated_at", Sat, 03 Dec 2011 14:47:20 UTC +00:00]]

  def update
    @game = Game.find(params[:id])
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @game = Game.find(params[:id])
    @game.destroy
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 1]]