trunk/app/controllers/plays_controller.rb

SELECT "plays".* FROM "plays"
---
  def index
    @plays = Play.all

SELECT "plays".* FROM "plays" WHERE "plays"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @play = Play.find(params[:id])

SELECT "plays".* FROM "plays" WHERE "plays"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @play = Play.find(params[:id])

SELECT "challenges".* FROM "challenges" WHERE "challenges"."game_id" = 1
SELECT "games".* FROM "games" WHERE "games"."id" = 1 LIMIT 1
INSERT INTO "player_challenges" ("challenge_id", "created_at", "play_id", "status", "updated_at") VALUES (?, ?, ?, ?, ?)  [["challenge_id", 1], ["created_at", Thu, 08 Dec 2011 22:00:18 UTC +00:00], ["play_id", 2], ["status", nil], ["updated_at", Thu, 08 Dec 2011 22:00:18 UTC +00:00]]
INSERT INTO "plays" ("created_at", "finished_at", "game_id", "player_id", "started_at", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @play = Play.new(params[:play])
    @play.startedAt = Time.now
    @play.game.challenges.each do |challenge|
      playerChallenge = nil
      case challenge.class
      when CaptureCode.class
        playerChallenge = CapturingCode.new
      when EnterMessage.class
        playerChallenge = EnteringMessage.new
      end
      playerChallenge.challenge = challenge
      playerChallenge.play = @play
      @play.player_challenges << playerChallenge

SELECT "plays".* FROM "plays" WHERE "plays"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "plays" SET "updated_at" = '2011-12-03 16:43:17.371682', "game_id" = 1 WHERE "plays"."id" = 1
---
  def update
    @play = Play.find(params[:id])

    respond_to do |format|
      if @play.update_attributes(params[:play])

SELECT "plays".* FROM "plays" WHERE "plays"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "plays" WHERE "plays"."id" = ?  [["id", 1]]
---
  def destroy
    @play = Play.find(params[:id])
    @play.destroy