trunk/app/controllers/reward_collections_controller.rb

  def index
    @reward_collections = RewardCollection.all
---
SELECT "reward_collections".* FROM "reward_collections"

  def show
    @reward_collection = RewardCollection.find(params[:id])
---
SELECT "reward_collections".* FROM "reward_collections" WHERE "reward_collections"."id" = ? LIMIT 1  [["id", "1"]]