trunk/app/controllers/rewards_controller.rb

  def index
    @rewards = Reward.all
---
SELECT "rewards".* FROM "rewards"

  def show
    @reward = Reward.find(params[:id])
---
SELECT "rewards".* FROM "rewards" WHERE "rewards"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @reward = Reward.find(params[:id])
---
SELECT "rewards".* FROM "rewards" WHERE "rewards"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @reward = Reward.new(params[:reward])
    @reward.creator = current_user
    respond_to do |format|
      if @reward.save
---
INSERT INTO "rewards" ("created_at", "creator_id", "description", "expirationDate", "image_content_type", "image_file_name", "image_updated_at", "imgae_file_size", "priceInPoints", "sponsor_id", "updated_at", "userLimit") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @reward = Reward.find(params[:id])

    respond_to do |format|
      if @reward.update_attributes(params[:reward])
---
SELECT "rewards".* FROM "rewards" WHERE "rewards"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "rewards" SET "image_updated_at" = '2011-12-08 18:46:26.867208', "creator_id" = 1, "image_file_name" = 'reward2.jpg', "image_content_type" = 'image/jpeg', "updated_at" = '2011-12-08 18:46:26.994238', "sponsor_id" = 1 WHERE "rewards"."id" = 1