app/controllers/challenges_controller.rb

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @challenge = Challenge.find(params[:id])

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @challenge = Challenge.find(params[:id])

INSERT INTO "challenges" ("created_at", "description", "game_id", "points", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 03 Dec 2011 15:46:58 UTC +00:00], ["description", "2231"], ["game_id", 2], ["points", 123], ["title", "3"], ["updated_at", Sat, 03 Dec 2011 15:46:58 UTC +00:00]]
---
  def create
    @challenge = Challenge.new(params[:challenge])

    respond_to do |format|
      if @challenge.save

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @challenge = Challenge.find(params[:id])

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "challenges" WHERE "challenges"."id" = ?  [["id", 980190962]]
---
  def destroy
    @challenge = Challenge.find(params[:id])
    @challenge.destroy