app/controllers/games_controller.rb

INSERT INTO "games" ("created_at", "creator_id", "description", "status", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 03 Dec 2011 14:47:20 UTC +00:00], ["creator_id", 1], ["description", ""], ["status", ""], ["title", ""], ["updated_at", Sat, 03 Dec 2011 14:47:20 UTC +00:00]]
---
  def create
    @game = Game.new(params[:game])
    @game.creator = current_user
    respond_to do |format|
      if @game.save

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @game = Game.find(params[:id])