app/controllers/player_challenges_controller.rb

  def index
    @player_challenges = PlayerChallenge.all
---
SELECT "player_challenges".* FROM "player_challenges"

  def show
    @player_challenge = PlayerChallenge.find(params[:id])
---
SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = 1 LIMIT 1
SELECT "player_challenges".* FROM "player_challenges" WHERE "player_challenges"."id" = ? LIMIT 1  [["id", "1"]]