app/controllers/plays_controller.rb

SELECT "plays".* FROM "plays"
---
  def index
    @plays = Play.all

SELECT "plays".* FROM "plays" WHERE "plays"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @play = Play.find(params[:id])

SELECT "plays".* FROM "plays" WHERE "plays"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @play = Play.find(params[:id])

INSERT INTO "plays" ("created_at", "finishedAt", "game_id", "player_id", "startedAt", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @play = Play.new(params[:play])
    @play.startedAt = Time.now
    @play.game.challenges.each do |challenge|
      playerChallenge = PlayerChallenge.new
      playerChallenge.challenge = challenge
      playerChallenge.play = @play
      @play.player_challenges << playerChallenge

SELECT "plays".* FROM "plays" WHERE "plays"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "plays" SET "updated_at" = '2011-12-03 16:43:17.371682', "game_id" = 1 WHERE "plays"."id" = 1
---
  def update
    @play = Play.find(params[:id])

    respond_to do |format|
      if @play.update_attributes(params[:play])

SELECT "plays".* FROM "plays" WHERE "plays"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "plays" WHERE "plays"."id" = ?  [["id", 1]]
---
  def destroy
    @play = Play.find(params[:id])
    @play.destroy