app/controllers/rewards_controller.rb

SELECT "rewards".* FROM "rewards"
---
  def index
    @rewards = Reward.all

SELECT "rewards".* FROM "rewards" WHERE "rewards"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @reward = Reward.find(params[:id])

SELECT "rewards".* FROM "rewards" WHERE "rewards"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "rewards" SET "description" = 'asdfasdf dd', "image_updated_at" = '2011-12-08 09:04:53.661802', "updated_at" = '2011-12-08 09:04:55.111795' WHERE "rewards"."id" = 1
---
  def update
    @reward = Reward.find(params[:id])

    respond_to do |format|
      if @reward.update_attributes(params[:reward])