app/controllers/users_controller.rb

INSERT INTO "users" ("collectedPoints", "created_at", "login", "role", "updated_at") VALUES (?, ?, ?, ?, ?)  [["collectedPoints", 0], ["created_at", Sat, 03 Dec 2011 14:53:49 UTC +00:00], ["login", "test"], ["role", "a"], ["updated_at", Sat, 03 Dec 2011 14:53:49 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save